Расширение/InformationRegisters/РКЦ_РеакцииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РКЦ_РеакцииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Реакция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РКЦ_Реакции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширение/CommonModules/РКЦ_Реакции/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма, ПараметрыРазмещения) Экспорт
	
	ЭтоФормаСписка = Ложь;
	Параметры = Форма.Параметры;
	ЕстьПараметрыСписка = Параметры.Свойство("Отбор") И Параметры.Свойство("ТекущаяСтрока");
	Если ЕстьПараметрыСписка Тогда
		ЭтоФормаСписка = Истина;
	КонецЕсли;
	//
	//РеквизитИнициализирован = Новый РеквизитФормы("РКЦ_Инициализирован", Новый ОписаниеТипов("Булево"));
	//Форма.ИзменитьРеквизиты(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитИнициализирован));
	//Форма.РКЦ_Инициализирован = Ложь;
	
	Если ЭтоФормаСписка Тогда
		
		ПереданныеПараметры = ПараметрыРазмещения;
		ПараметрыРазмещения = ПараметрыРазмещения();
		ЗаполнитьЗначенияСвойств(ПараметрыРазмещения, ПереданныеПараметры);
		
		ТаблицаСписка = ПараметрыРазмещения.ПолеИлиТаблица;
		ПолеСписка = Неопределено;
		Если ТипЗнч(ТаблицаСписка) = Тип("ПолеФормы") Тогда
			ПолеСписка = ПараметрыРазмещения.ПолеИлиТаблица;
			ТаблицаСписка = ПолеСписка.Родитель;
		КонецЕсли;
		
		Если ТипЗнч(ТаблицаСписка) <> Тип("ТаблицаФормы")
			Или ТипЗнч(Форма[ТаблицаСписка.ПутьКДанным]) <> Тип("ДинамическийСписок") Тогда
			//TODO: Нормальную проверку параметра
			ВызватьИсключение "Некорректно заполнены параметры размещения на форме списка";
		КонецЕсли;
		
		// Добавление колонки динамического списка
		ДинамическийСписок = Форма[ТаблицаСписка.ПутьКДанным];
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		ЗаполнитьЗначенияСвойств(СвойстваСписка, ДинамическийСписок);
		
		Если Не ЗначениеЗаполнено(СвойстваСписка.ОсновнаяТаблица)
			Или Не РКЦ_Реакции.НастройкиРеакцийОбъекта(СвойстваСписка.ОсновнаяТаблица) Тогда
			Возврат;
		КонецЕсли;
		
		Если ДинамическийСписок.ПроизвольныйЗапрос Тогда
			
			СхемаЗапроса = Новый СхемаЗапроса;
			СхемаЗапроса.УстановитьТекстЗапроса(СвойстваСписка.ТекстЗапроса);
			Для Каждого ПакетЗапросов ИЗ СхемаЗапроса.ПакетЗапросов Цикл
				Если ПакетЗапросов.ТаблицаДляПомещения = "" Тогда
					ЗапросВыбора = ПакетЗапросов;
				КонецЕсли;
			КонецЦикла;
			ОператорВыбора = ЗапросВыбора.Операторы[0];
			Выражение = ОператорВыбора.ВыбираемыеПоля.Добавить("NULL");
			ЗапросВыбора.Колонки.Найти(Выражение).Псевдоним = "РКЦ_Реакции";
			СвойстваСписка.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
			
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(ТаблицаСписка, СвойстваСписка);
			
			МассивПолейСОграничениями = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("РКЦ_Реакции");
			ДинамическийСписок.УстановитьОграниченияИспользованияВГруппировке(МассивПолейСОграничениями);
			ДинамическийСписок.УстановитьОграниченияИспользованияВОтборе     (МассивПолейСОграничениями);
			ДинамическийСписок.УстановитьОграниченияИспользованияВПорядке    (МассивПолейСОграничениями);
			//
			//Форма.РКЦ_Инициализирован = Истина;
			
		Иначе
			
			ТекстСообщения = нСтр("ru='Не поддерживается вывод реакций в список с непроизвольным запросом'", "ru");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
			
		КонецЕсли;
		
		// Добавление поля таблицы
		ПолеРеакций = Форма.Элементы.Вставить(ТаблицаСписка.Имя + "РКЦ_Реакции", Тип("ПолеФормы"), ТаблицаСписка, ПолеСписка);
		ПолеРеакций.Вид              = ВидПоляФормы.ПолеВвода;
		ПолеРеакций.ПутьКДанным      = ТаблицаСписка.ПутьКДанным + ".РКЦ_Реакции";
		ПолеРеакций.Заголовок        = нСтр("ru='Реакции'", "ru");
		ПолеРеакций.АвтоВысотаЯчейки = Истина;
		ПолеРеакций.Доступность      = Ложь;
		ПолеРеакций.Ширина           = 23;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыРазмещения() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ПолеИлиТаблица");
	Возврат Результат;
	
КонецФункции

Процедура ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) Экспорт
	
	Перем КлючСтроки;
	
	Для Каждого Строка Из Строки Цикл
		КлючСтроки = Строка.Ключ;
		Прервать;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(КлючСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектМетаданных = КлючСтроки.Метаданные();
	ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	Если Не РКЦ_Реакции.НастройкиРеакцийОбъекта(ПолноеИмя) Тогда
		Возврат;
	КонецЕсли;
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных);
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеакцииОбъектов.Идентификатор КАК Идентификатор,
	|	РеакцииОбъектов.Реакция КАК Реакция,
	|	КОЛИЧЕСТВО(РеакцииОбъектов.Реакция) КАК Число,
	|	МАКСИМУМ(РеакцииОбъектов.Пользователь = &ТекущийПользователь) КАК Наша
	|ПОМЕСТИТЬ РеакцииОбъекта
	|ИЗ
	|	РегистрСведений.РКЦ_РеакцииОбъектов КАК РеакцииОбъектов
	|ГДЕ
	|	РеакцииОбъектов.ИдентификаторОбъектаМетаданных = &ИдентификаторОбъектаМетаданных
	|		И РеакцииОбъектов.Идентификатор В(&Идентификаторы)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеакцииОбъектов.Идентификатор,
	|	РеакцииОбъектов.Реакция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеакцииОбъекта.Идентификатор КАК Идентификатор,
	|	РеакцииОбъекта.Число КАК Число,
	|	РеакцииОбъекта.Наша КАК Наша,
	|	РеакцииОбъекта.Реакция КАК Реакция,
	|	РКЦ_Реакции.Картинка КАК Картинка,
	|	РКЦ_Реакции.Наименование КАК Наименование
	|ИЗ
	|	РеакцииОбъекта КАК РеакцииОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РКЦ_Реакции КАК РКЦ_Реакции
	|		ПО РеакцииОбъекта.Реакция = РКЦ_Реакции.Ссылка
	|ИТОГИ ПО
	|	Идентификатор";
	
	Идентификаторы = Новый Массив;
	Для Каждого Ключ Из Строки.ПолучитьКлючи() Цикл
		Идентификаторы.Добавить(Ключ.УникальныйИдентификатор());
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных", ИдентификаторОбъектаМетаданных);
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъектов.Следующий() Цикл
		
		СтрокаСписка = Строки[Менеджер.ПолучитьСсылку(ВыборкаОбъектов.Идентификатор)];
		
		СписокРеакций = Новый СписокЗначений;
		ВыборкаРеакций = ВыборкаОбъектов.Выбрать();
		Пока ВыборкаРеакций.Следующий() Цикл
			СписокРеакций.Добавить(
				ВыборкаРеакций.Наименование,
				ВыборкаРеакций.Число,
				ВыборкаРеакций.Наша,
				ВыборкаРеакций.Картинка.Получить()
			);
		КонецЦикла;
		
		Если СтрокаСписка.Данные.Свойство("РКЦ_Реакции") Тогда
			СтрокаСписка.Данные    ["РКЦ_Реакции"] = СписокРеакций;
			СтрокаСписка.Оформление["РКЦ_Реакции"].УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ФонАктивногоВариантаВторой);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// Не используется
Процедура ПриОтправкеСерверногоОповещения(ИмяОповещения, ВариантыПараметров) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиРеакцийОбъекта(ПолноеИмя, Настройки = Неопределено) Экспорт
	
	Настройки = РКЦ_РеакцииПовтИсп.НастройкиРеакцийОбъекта(ПолноеИмя);
	Возврат Настройки <> Неопределено;
	
КонецФункции

#КонецОбласти
